In [1]:
from google.colab import files
files.upload()

Saving categorical_data.csv to categorical_data.csv

{'categorical_data.csv': b'Name,age,salary,label\r\nA,1,12,Yes\r\nB,3,,No\r\nC,2,1212,No\r\nC,,222,Yes\r\nA,5,32,Yes\r\nB,4,222,No\r\n'}

In [2]:
import pandas as pd

In [40]:
df = pd.read_csv("categorical_data.csv")

Kiểm tra xem các cột có bao nhiêu missing value

In [41]:
df.isnull().sum()

Name      0
age       1
salary    1
label     0
dtype: int64

Thay thế giá trị missing value (True) bằng giá trị trung bình của bảng age (df['age'].mean() là giá trị trung bình)

In [44]:
df['age'].fillna(df['age'].mean(), inplace = True)

In [45]:
df.head(6)

  Name  age  salary label
0    A  1.0    12.0   Yes
1    B  3.0     NaN    No
2    C  2.0  1212.0    No
3    C  3.0   222.0   Yes
4    A  5.0    32.0   Yes
5    B  4.0   222.0    No

In [46]:
df['salary'].fillna(df['salary'].mean(), inplace = True)

In [48]:
df['salary'].mean()

340.0

Thay thế giá trị missing value (True) bằng giá trị trung bình của bảng salary (df['salary'].mean() là giá trị trung bình)

In [47]:
df.head(6)

  Name  age  salary label
0    A  1.0    12.0   Yes
1    B  3.0   340.0    No
2    C  2.0  1212.0    No
3    C  3.0   222.0   Yes
4    A  5.0    32.0   Yes
5    B  4.0   222.0    No

Cách 1: Tìm hiểu SimpleImpute, sử dụng strategy là mean (là trung bình cộng)

In [49]:
import pandas as pd
import numpy as np

In [50]:
df = pd.read_csv("categorical_data.csv")

In [53]:
df.head(6)

  Name  age  salary label
0    A  1.0    12.0   Yes
1    B  3.0     NaN    No
2    C  2.0  1212.0    No
3    C  NaN   222.0   Yes
4    A  5.0    32.0   Yes
5    B  4.0   222.0    No

Gói sklearn.impute được sử dụng để nhập lớp SimpleImputer  .

SimpleImputer nhận hai đối số như giá trị thiếu và chiến lược.

Phương thức fit_transform được gọi trên phiên bản của SimpleImputer để xác định các giá trị còn thiếu.

In [51]:
from sklearn.impute import SimpleImputer

In [54]:
imputer = SimpleImputer(missing_values=np.NaN, strategy='mean')
 
df.age = imputer.fit_transform(df['age'].values.reshape(-1,1))[:,0]
df

  Name  age  salary label
0    A  1.0    12.0   Yes
1    B  3.0     NaN    No
2    C  2.0  1212.0    No
3    C  3.0   222.0   Yes
4    A  5.0    32.0   Yes
5    B  4.0   222.0    No

In [55]:
imputer = SimpleImputer(missing_values=np.NaN, strategy='mean')
 
df.salary = imputer.fit_transform(df['salary'].values.reshape(-1,1))[:,0]
df

  Name  age  salary label
0    A  1.0    12.0   Yes
1    B  3.0   340.0    No
2    C  2.0  1212.0    No
3    C  3.0   222.0   Yes
4    A  5.0    32.0   Yes
5    B  4.0   222.0    No